'''
9/13 화
*미니 플젝:QRcode generator
-라이브러리 설치 및 활용
-요구사항을 생각해서 그것에 맞는 라이브러리가 있을까? 그것을 활용해야지!

*미니 플젝: OCR (영수증 분석)
-라이브러리 활용
-리스트 자료형
-for 반복문

*미니 플젝 : voice assistance
-라이브러리 활용
-기능 단위 잘라서 구현 (STT-> 로직 -> TTS)-> 사용자 정의 함수
-예외 처리 try~except
-if else, if elif
-while 반복문 => while(True) 무한루프
-continue, break

'''


'''
9/14 수
*미니플젝: crawling - 영화순위, 베스트 상품
라이브러리, 예외처리, if, for, 파일 IO
-현업에서 많이 활용하는 코드
1 크롤링 기술. 구글링.
2라이브러리 활용
3상품명 단위 하나
4텍스트 추출
5for 반복
6 if 제어문 - 반복문 판단

어디에 어떨 때 왜 사용하는 지 알아가는 프로그래밍 사고력

'''

'''
9/15 목
for문 사용에 대해 익숙해지고 자신감 가지는 것이 목표
여러가지 기능이 복합되어 있는 프로그램을 파이썬으로 만들어 본다.

슬랙으로 완성한 이미지 파일을 제출하는 것으로 -> 슬랙 : 코드 뽐내기
오후 : 데이터 분석을 위한 판다스 라이브러리 사용법

'''